[
  {
    "title": "The Shawshank Redemption",
    "year": 1994,
    "length": 142,
    "genres": ["Drama"],
    "description": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.",
    "stars": ["Tim Robbins", "Morgan Freeman", "Bob Gunton", "William Sadler"],
    "director": "Frank Darabont",
    "plot": "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red.",
    "poster": "https://m.media-amazon.com/images/M/MV5BMDFkYTc0MGEtZmNhMC00ZDIzLWFmNTEtODM1ZmRlYWMwMWFmXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 9.3,
    "imdbUrl": "https://www.imdb.com/title/tt0111161/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "The Godfather",
    "year": 1972,
    "length": 175,
    "genres": ["Crime", "Drama"],
    "description": "The aging patriarch of an organized crime dynasty in postwar New York City transfers control of his clandestine empire to his reluctant youngest son.",
    "stars": ["Marlon Brando", "Al Pacino", "James Caan", "Diane Keaton"],
    "director": "Francis Ford Coppola",
    "plot": "The Godfather \"Don\" Vito Corleone is the head of the Corleone mafia family in New York. He is at the event of his daughter's wedding. Michael, Vito's youngest son and a decorated WW II Marine is also present at the wedding. Michael seems to be uninterested in being a part of the family business. Vito is a powerful man, and is kind to all those who give him respect but is ruthless against those who do not. But when a powerful and treacherous rival wants to sell drugs and needs the Don's influence for the same, Vito refuses to do it. What follows is a clash between Vito's fading old values and the new ways which may cause Michael to do the thing he was most reluctant in doing and wage a mob war against all the other mafia families which could tear the Corleone family apart.",
    "poster": "https://static.posters.cz/image/750/poster/the-godfather-cervena-ruza-i106943.jpg",
    "imdbRating": 9.2,
    "imdbUrl": "https://www.imdb.com/title/tt0068646/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "The Dark Knight",
    "year": 2008,
    "length": 152,
    "genres": ["Action", "Crime", "Drama"],
    "description": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
    "stars": [
      "Christian Bale",
      "Heath Ledger",
      "Aaron Eckhart",
      "Michael Caine"
    ],
    "director": "Christopher Nolan",
    "plot": "Set within a year after the events of Batman Begins (2005), Batman, Lieutenant James Gordon, and new District Attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City, until a mysterious and sadistic criminal mastermind known only as \"The Joker\" appears in Gotham, creating a new wave of chaos. Batman's struggle against The Joker becomes deeply personal, forcing him to \"confront everything he believes\" and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent, and Rachel Dawes.",
    "poster": "https://m.media-amazon.com/images/M/MV5BMTMxNTMwODM0NF5BMl5BanBnXkFtZTcwODAyMTk2Mw@@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 9.0,
    "imdbUrl": "https://www.imdb.com/title/tt0468569/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "The Godfather: Part II",
    "year": 1974,
    "length": 202,
    "genres": ["Crime", "Drama"],
    "description": "The early life and career of Vito Corleone in 1920s New York City is portrayed, while his son, Michael, expands and tightens his grip on the family crime syndicate.",
    "stars": ["Al Pacino", "Robert De Niro", "Robert Duvall", "Diane Keaton"],
    "director": "Francis Ford Coppola",
    "plot": "The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
    "poster": "https://i.pinimg.com/originals/ea/29/0d/ea290d22010032b85a762c5267c2f735.jpg",
    "imdbRating": 9.0,
    "imdbUrl": "https://www.imdb.com/title/tt0071562/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "12 Angry Men",
    "year": 1957,
    "length": 96,
    "genres": ["Crime", "Drama"],
    "description": "The jury in a New York City murder trial is frustrated by a single member whose skeptical caution forces them to more carefully consider the evidence before jumping to a hasty verdict.",
    "stars": ["Henry Fonda", "Lee J. Cobb", "Martin Balsam", "John Fiedler"],
    "director": " Sidney Lumet",
    "plot": "The defense and the prosecution have rested, and the jury is filing into the jury room to decide if a young man is guilty or innocent of murdering his father. What begins as an open-and-shut case of murder soon becomes a detective story that presents a succession of clues creating doubt, and a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, AND each other. Based on the play, all of the action takes place on the stage of the jury room.",
    "poster": "https://m.media-amazon.com/images/M/MV5BMWU4N2FjNzYtNTVkNC00NzQ0LTg0MjAtYTJlMjFhNGUxZDFmXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 9.0,
    "imdbUrl": "https://www.imdb.com/title/tt0050083/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "The Lord of the Rings: The Return of the King",
    "year": 2003,
    "length": 201,
    "genres": ["Action", "Adventure", "Drama"],
    "description": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.",
    "stars": [
      "Elijah Wood",
      "Viggo Mortensen",
      "Ian McKellen",
      "Orlando Bloom"
    ],
    "director": "Peter Jackson",
    "plot": "The final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Frodo and Sam reach Mordor in their quest to destroy the One Ring, while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith.",
    "poster": "https://m.media-amazon.com/images/M/MV5BNzA5ZDNlZWMtM2NhNS00NDJjLTk4NDItYTRmY2EwMWZlMTY3XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.9,
    "imdbUrl": "https://www.imdb.com/title/tt0167260/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "Pulp Fiction",
    "year": 1994,
    "length": 154,
    "genres": ["Crime", "Drama"],
    "description": "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.",
    "stars": [
      "John Travolta",
      "Uma Thurman",
      "Samuel L. Jackson",
      "Bruce Willis"
    ],
    "director": "Quentin Tarantino",
    "plot": "Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) are two hit men who are out to retrieve a suitcase stolen from their employer, mob boss Marsellus Wallace (Ving Rhames). Wallace has also asked Vincent to take his wife Mia (Uma Thurman) out a few days later when Wallace himself will be out of town. Butch Coolidge (Bruce Willis) is an aging boxer who is paid by Wallace to lose his fight. The lives of these seemingly unrelated people are woven together comprising of a series of funny, bizarre and uncalled-for incidents.",
    "poster": "https://static.posters.cz/image/750/poster/pulp-fiction-cover-i1288.jpg",
    "imdbRating": 8.9,
    "imdbUrl": "https://www.imdb.com/title/tt0110912/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "Schindler's List",
    "year": 1993,
    "length": 195,
    "genres": ["Biography", "Drama", "History"],
    "description": "In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
    "stars": [
      "Liam Neeson",
      "Ralph Fiennes",
      "Ben Kingsley",
      "Caroline Goodall"
    ],
    "director": "Steven Spielberg",
    "plot": "Oskar Schindler is a vain and greedy German businessman who becomes an unlikely humanitarian amid the barbaric German Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us.",
    "poster": "https://m.media-amazon.com/images/M/MV5BNDE4OTMxMTctNmRhYy00NWE2LTg3YzItYTk3M2UwOTU5Njg4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.9,
    "imdbUrl": "https://www.imdb.com/title/tt0108052/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "Inception",
    "year": 2010,
    "length": 148,
    "genres": ["Action", "Adventure", "Sci-Fi"],
    "description": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team to disaster.",
    "stars": [
      "Leonardo DiCaprio",
      "Joseph Gordon-Levitt",
      "Elliot Page",
      "Ken Watanabe"
    ],
    "director": "Christopher Nolan",
    "plot": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible, inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea, but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming.",
    "poster": "https://m.media-amazon.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.8,
    "imdbUrl": "https://www.imdb.com/title/tt1375666/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "Fight Club",
    "year": 1999,
    "length": 139,
    "genres": ["Drama"],
    "description": "An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.",
    "stars": ["Brad Pitt", "Edward Norton", "Meat Loaf", "Zach Grenier"],
    "director": "David Fincher",
    "plot": "A nameless first person narrator (Edward Norton) attends support groups in attempt to subdue his emotional state and relieve his insomniac state. When he meets Marla (Helena Bonham Carter), another fake attendee of support groups, his life seems to become a little more bearable. However when he associates himself with Tyler (Brad Pitt) he is dragged into an underground fight club and soap making scheme. Together the two men spiral out of control and engage in competitive rivalry for love and power.",
    "poster": "https://m.media-amazon.com/images/M/MV5BMmEzNTkxYjQtZTc0MC00YTVjLTg5ZTEtZWMwOWVlYzY0NWIwXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.8,
    "imdbUrl": "https://www.imdb.com/title/tt0137523/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "The Lord of the Rings: The Fellowship of the Ring",
    "year": 2001,
    "length": 178,
    "genres": ["Action", "Adventure", "Drama"],
    "description": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
    "stars": ["Elijah Wood", "Ian McKellen", "Orlando Bloom", "Sean Bean"],
    "director": "Peter Jackson",
    "plot": "An ancient Ring thought lost for centuries has been found, and through a strange twist of fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it. However, he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir, and his three Hobbit friends Merry, Pippin, and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign.",
    "poster": "https://m.media-amazon.com/images/M/MV5BN2EyZjM3NzUtNWUzMi00MTgxLWI0NTctMzY4M2VlOTdjZWRiXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.8,
    "imdbUrl": "https://www.imdb.com/title/tt0120737/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "Forrest Gump",
    "year": 1994,
    "length": 142,
    "genres": ["Drama", "Romance"],
    "description": "The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal and other historical events unfold from the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart.",
    "stars": ["Tom Hanks", "Robin Wright", "Gary Sinise", "Sally Field"],
    "director": "Robert Zemeckis",
    "plot": "Forrest Gump is a simple man with a low I.Q. but good intentions. He is running through childhood with his best and only friend Jenny. His 'mama' teaches him the ways of life and leaves him to choose his destiny. Forrest joins the army for service in Vietnam, finding new friends called Dan and Bubba, he wins medals, creates a famous shrimp fishing fleet, inspires people to jog, starts a ping-pong craze, creates the smiley, writes bumper stickers and songs, donates to people and meets the president several times. However, this is all irrelevant to Forrest who can only think of his childhood sweetheart Jenny Curran, who has messed up her life. Although in the end all he wants to prove is that anyone can love anyone.",
    "poster": "https://media.ginza.se/Images/item_img_verylarge/8218.jpg",
    "imdbRating": 8.8,
    "imdbUrl": "https://www.imdb.com/title/tt0109830/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "The Good, the Bad and the Ugly",
    "year": 1966,
    "length": 178,
    "genres": ["Adventure", "Western"],
    "description": "A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.",
    "stars": ["Clint Eastwood", "Eli Wallach", "Lee Van Cleef", "Aldo Giuffrè"],
    "director": "Sergio Leone",
    "plot": "Blondie, The Good (Clint Eastwood), is a professional gunslinger who is out trying to earn a few dollars. Angel Eyes, The Bad (Lee Van Cleef), is a hitman who always commits to a task and sees it through--as long as he's paid to do so. And Tuco, The Ugly (Eli Wallach), is a wanted outlaw trying to take care of his own hide. Tuco and Blondie share a partnership making money off of Tuco's bounty, but when Blondie unties the partnership, Tuco tries to hunt down Blondie. When Blondie and Tuco come across a horse carriage loaded with dead bodies, they soon learn from the only survivor, Bill Carson (Antonio Casale), that he and a few other men have buried a stash of gold in a cemetery. Unfortunately, Carson dies and Tuco only finds out the name of the cemetery, while Blondie finds out the name on the grave. Now the two must keep each other alive in order to find the gold. Angel Eyes (who had been looking for Bill Carson) discovers that Tuco and Blondie met with Carson and knows they know where the gold is; now he needs them to lead him to it. Now The Good, the Bad, and the Ugly must all battle it out to get their hands on $200,000.00 worth of gold.",
    "poster": "https://m.media-amazon.com/images/M/MV5BOTU5NDkzNTM5MV5BMl5BanBnXkFtZTgwMDU4ODE5MDE@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.8,
    "imdbUrl": "https://www.imdb.com/title/tt0060196/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "Spider-Man: No Way Home",
    "year": 2021,
    "length": 148,
    "genres": ["Action", "Adventure", "Fantasy"],
    "description": "With Spider-Man's identity now revealed, Peter asks Doctor Strange for help. When a spell goes wrong, dangerous foes from other worlds start to appear, forcing Peter to discover what it truly means to be Spider-Man.",
    "stars": ["Tom Holland", "Zendaya", "Benedict Cumberbatch", "Jacob"],
    "director": "Jon Watts",
    "plot": "Peter Parker's secret identity is revealed to the entire world. Desperate for help, Peter turns to Doctor Strange to make the world forget that he is Spider-Man. The spell goes horribly wrong and shatters the multiverse, bringing in monstrous villains that could destroy the world.",
    "poster": "https://m.media-amazon.com/images/M/MV5BZWMyYzFjYTYtNTRjYi00OGExLWE2YzgtOGRmYjAxZTU3NzBiXkEyXkFqcGdeQXVyMzQ0MzA0NTM@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.7,
    "imdbUrl": "https://www.imdb.com/title/tt10872600/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "The Lord of the Rings: The Two Towers",
    "year": 2002,
    "length": 179,
    "genres": ["Action", "Adventure", "Drama"],
    "description": "While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.",
    "stars": [
      "Elijah Wood",
      "Ian McKellen",
      "Viggo Mortensen",
      "Orlando Bloom"
    ],
    "director": "Peter Jackson",
    "plot": "The continuing quest of Frodo and the Fellowship to destroy the One Ring. Frodo and Sam discover they are being followed by the mysterious Gollum. Aragorn, the Elf archer Legolas, and Gimli the Dwarf encounter the besieged Rohan kingdom, whose once great King Theoden has fallen under Saruman's deadly spell.",
    "poster": "https://m.media-amazon.com/images/M/MV5BZGMxZTdjZmYtMmE2Ni00ZTdkLWI5NTgtNjlmMjBiNzU2MmI5XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.7,
    "imdbUrl": "https://www.imdb.com/title/tt0167261/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "The Matrix",
    "year": 1999,
    "length": 136,
    "genres": ["Action", "Sci-Fi"],
    "description": "When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.",
    "stars": [
      "Keanu Reeves",
      "Laurence Fishburne",
      "Carrie-Anne Moss",
      "Hugo Weaving"
    ],
    "director": "Lana Wachowski, Lilly Wachowski",
    "plot": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. As a rebel against the machines, Neo must confront the agents: super-powerful computer programs devoted to stopping Neo and the entire human rebellion.",
    "poster": "https://m.media-amazon.com/images/M/MV5BNzQzOTk3OTAtNDQ0Zi00ZTVkLWI0MTEtMDllZjNkYzNjNTc4L2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.7,
    "imdbUrl": "https://www.imdb.com/title/tt0133093/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "Goodfellas",
    "year": 1990,
    "length": 146,
    "genres": ["Biography", "Crime", "Drama"],
    "description": "The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito in the Italian-American crime syndicate.",
    "stars": ["Robert De Niro", "Ray Liotta", "Joe Pesci", "Lorraine Bracco"],
    "director": "Martin Scorsese",
    "plot": "Henry Hill might be a small time gangster, who may have taken part in a robbery with Jimmy Conway and Tommy De Vito, two other gangsters who might have set their sights a bit higher. His two partners could kill off everyone else involved in the robbery, and slowly start to think about climbing up through the hierarchy of the Mob. Henry, however, might be badly affected by his partners' success, but will he consider stooping low enough to bring about the downfall of Jimmy and Tommy?",
    "poster": "https://m.media-amazon.com/images/M/MV5BY2NkZjEzMDgtN2RjYy00YzM1LWI4ZmQtMjIwYjFjNmI3ZGEwXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.7,
    "imdbUrl": "https://www.imdb.com/title/tt0099685/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "Star Wars: Episode V - The Empire Strikes Back",
    "year": 1980,
    "length": 124,
    "genres": ["Action", "Adventure", "Fantasy"],
    "description": "After the Rebels are brutally overpowered by the Empire on the ice planet Hoth, Luke Skywalker begins Jedi training with Yoda, while his friends are pursued across the galaxy by Darth Vader and bounty hunter Boba Fett.",
    "stars": [
      "Mark Hamill",
      "Harrison Ford",
      "Carrie Fisher",
      "Billy Dee Williams"
    ],
    "director": "Irvin Kershner",
    "plot": "Luke Skywalker, Han Solo, Princess Leia and Chewbacca face attack by the Imperial forces and its AT-AT walkers on the ice planet Hoth. While Han and Leia escape in the Millennium Falcon, Luke travels to Dagobah in search of Yoda. Only with the Jedi Master's help will Luke survive when the Dark Side of the Force beckons him into the ultimate duel with Darth Vader.",
    "poster": "https://m.media-amazon.com/images/M/MV5BYmU1NDRjNDgtMzhiMi00NjZmLTg5NGItZDNiZjU5NTU4OTE0XkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.7,
    "imdbUrl": "https://www.imdb.com/title/tt0080684/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "One Flew Over the Cuckoo's Nest",
    "year": 1975,
    "length": 133,
    "genres": ["Drama"],
    "description": "A criminal pleads insanity and is admitted to a mental institution, where he rebels against the oppressive nurse and rallies up the scared patients.",
    "stars": [
      "Jack Nicholson",
      "Louise Fletcher",
      "Michael Berryman",
      "Peter Brocco"
    ],
    "director": "Milos Forman",
    "plot": "McMurphy has a criminal past and has once again gotten himself into trouble and is sentenced by the court. To escape labor duties in prison, McMurphy pleads insanity and is sent to a ward for the mentally unstable. Once here, McMurphy both endures and stands witness to the abuse and degradation of the oppressive Nurse Ratched, who gains superiority and power through the flaws of the other inmates. McMurphy and the other inmates band together to make a rebellious stance against the atrocious Nurse.",
    "poster": "https://m.media-amazon.com/images/M/MV5BZjA0OWVhOTAtYWQxNi00YzNhLWI4ZjYtNjFjZTEyYjJlNDVlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.7,
    "imdbUrl": "https://www.imdb.com/title/tt0073486/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "Parasite",
    "year": 2019,
    "length": 132,
    "genres": ["Comedy", "Drama", "Thriller"],
    "description": "Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.",
    "stars": ["Kang-ho Song", "Sun-kyun Lee", "Yeo-jeong Cho", "Woo-sik Choi"],
    "director": "Bong Joon Ho",
    "plot": "The Kims - mother and father Chung-sook and Ki-taek, and their young adult offspring, son Ki-woo and daughter Ki-jung - are a poor family living in a shabby and cramped half basement apartment in a busy lower working class commercial district of Seoul. Without even knowing it, they, especially Mr. and Mrs. Kim, literally smell of poverty. Often as a collective, they perpetrate minor scams to get by, and even when they have jobs, they do the minimum work required. Ki-woo is the one who has dreams of getting out of poverty by one day going to university. Despite not having that university education, Ki-woo is chosen by his university student friend Min, who is leaving to go to school, to take over his tutoring job to Park Da-hye, who Min plans to date once he returns to Seoul and she herself is in university. The Parks are a wealthy family who for four years have lived in their modernistic house designed by and the former residence of famed architect Namgoong. While Mr. and Mrs. Park are all about status, Mrs. Park has a flighty, simpleminded mentality and temperament, which Min tells Ki-woo to feel comfortable in lying to her about his education to get the job. In getting the job, Ki-woo further learns that Mrs. Park is looking for an art therapist for the Parks' adolescent son, Da-song, Ki-woo quickly recommending his professional art therapist friend \"Jessica\", really Ki-jung who he knows can pull off the scam in being the easiest liar of the four Kims. In Ki-woo also falling for Da-hye, he begins to envision himself in that house, and thus the Kims as a collective start a plan for all the Kims, like Ki-jung using assumed names, to replace existing servants in the Parks' employ in orchestrating reasons for them to be fired. The most difficult to get rid of may be Moon-gwang, the Parks' housekeeper who literally came with the house - she Namgoong's housekeeper when he lived there - and thus knows all the little nooks and crannies of it better than the Parks themselves. The question then becomes how far the Kims can take this scam in their quest to become their version of the Parks.",
    "poster": "https://m.media-amazon.com/images/M/MV5BYWZjMjk3ZTItODQ2ZC00NTY5LWE0ZDYtZTI3MjcwN2Q5NTVkXkEyXkFqcGdeQXVyODk4OTc3MTY@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.6,
    "imdbUrl": "https://www.imdb.com/title/tt6751668/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  },
  {
    "title": "Interstellar",
    "year": 2014,
    "length": 169,
    "genres": ["Adventure", "Drama", "Sci-Fi"],
    "description": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.",
    "stars": [
      "Matthew McConaughey",
      "Anne Hathaway",
      "Jessica Chastain",
      "Mackenzie Foy"
    ],
    "director": "Christopher Nolan",
    "plot": "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life.",
    "poster": "https://m.media-amazon.com/images/M/MV5BZjdkOTU3MDktN2IxOS00OGEyLWFmMjktY2FiMmZkNWIyODZiXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_UX272_CR0,0,272,400_AL_.jpg",
    "imdbRating": 8.6,
    "imdbUrl": "https://www.imdb.com/title/tt0816692/",
    "price": 129.99,
    "currency": "SEK",
    "stock": 10
  }
]
